#### Terraform Plan Status: success

<details><summary>Show Plan</summary>

```
aws_iam_role.step_functions: Refreshing state... [id=nba-cap-development-step-functions]
aws_iam_role.lambda_execution: Refreshing state... [id=nba-cap-development-lambda-execution]
aws_cloudwatch_event_rule.monthly_ml_training: Refreshing state... [id=nba-cap-development-monthly-ml-training]
aws_iam_role.eventbridge_sfn: Refreshing state... [id=nba-cap-development-eventbridge-sfn-ml]
aws_vpc.main: Refreshing state... [id=vpc-0b6c5f3947a364991]
aws_iam_role.eventbridge_step_functions: Refreshing state... [id=nba-cap-development-eventbridge-sfn]
aws_cloudwatch_event_rule.weekly_ml_predictions: Refreshing state... [id=nba-cap-development-weekly-ml-predictions]
aws_cloudwatch_event_rule.monthly_etl: Refreshing state... [id=nba-cap-development-monthly-etl]
aws_secretsmanager_secret.db_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1]
aws_s3_bucket.data: Refreshing state... [id=nba-cap-development-data]
data.aws_ami.amazon_linux_2023: Reading...
aws_iam_role.bastion: Refreshing state... [id=nba-cap-development-bastion-role]
data.aws_sagemaker_prebuilt_ecr_image.sklearn: Reading...
data.aws_sagemaker_prebuilt_ecr_image.sklearn: Read complete after 0s [id=683313688378]
aws_iam_role.ml_pipeline_sfn: Refreshing state... [id=nba-cap-development-ml-pipeline-sfn]
aws_cloudwatch_event_rule.weekly_etl: Refreshing state... [id=nba-cap-development-weekly-etl]
aws_iam_role.sagemaker_execution: Refreshing state... [id=nba-cap-development-sagemaker-execution]
aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=nba-cap-development-lambda-execution-20260217211549022400000002]
aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=nba-cap-development-lambda-execution-20260217211549032400000003]
aws_iam_role_policy.step_functions_lambda: Refreshing state... [id=nba-cap-development-step-functions:nba-cap-development-step-functions-lambda]
aws_iam_role_policy_attachment.bastion_ssm: Refreshing state... [id=nba-cap-development-bastion-role-20260223231501912800000001]
aws_iam_instance_profile.bastion: Refreshing state... [id=nba-cap-development-bastion-profile]
aws_iam_role_policy_attachment.sagemaker_full_access: Refreshing state... [id=nba-cap-development-sagemaker-execution-20260226055128501200000001]
aws_s3_bucket_versioning.data: Refreshing state... [id=nba-cap-development-data]
aws_s3_object.feature_engineering_code: Refreshing state... [id=ml/code/feature_engineering.py]
aws_s3_bucket_server_side_encryption_configuration.data: Refreshing state... [id=nba-cap-development-data]
aws_s3_object.inference_code: Refreshing state... [id=ml/models/code/inference.py]
aws_s3_object.schema_sql: Refreshing state... [id=db/schema.sql]
aws_lambda_function.validate_data: Refreshing state... [id=nba-cap-development-validate-data]
aws_lambda_function.fetch_data: Refreshing state... [id=nba-cap-development-fetch-data]
aws_lambda_function.transform_data: Refreshing state... [id=nba-cap-development-transform-data]
aws_iam_role_policy.lambda_s3_rds: Refreshing state... [id=nba-cap-development-lambda-execution:nba-cap-development-lambda-s3-rds]
data.aws_ami.amazon_linux_2023: Read complete after 1s [id=ami-0b8ef021988a1db2b]
aws_s3_object.salary_cap_static_data: Refreshing state... [id=static/salary_cap_history.json]
aws_iam_role_policy.sagemaker_custom: Refreshing state... [id=nba-cap-development-sagemaker-execution:nba-cap-development-sagemaker-custom]
aws_security_group.bastion: Refreshing state... [id=sg-044703878f38eaf04]
aws_subnet.public: Refreshing state... [id=subnet-0f1c3b45289fc2f33]
aws_subnet.private_b: Refreshing state... [id=subnet-066bb8a4e7c4c5f71]
aws_route_table.private: Refreshing state... [id=rtb-029dd305c3f4ac761]
aws_subnet.private_a: Refreshing state... [id=subnet-024001c7e70b8e723]
aws_internet_gateway.main: Refreshing state... [id=igw-0043d0b7878bef291]
aws_security_group.rds: Refreshing state... [id=sg-0d332cdd9de9f1ea8]
aws_security_group.lambda: Refreshing state... [id=sg-0d348276a26bc3621]
aws_security_group.vpc_endpoints: Refreshing state... [id=sg-01985e1e8d1a5b899]
aws_instance.bastion: Refreshing state... [id=i-02e02a2a4a3e480d6]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-026914add1fbd9388]
aws_route_table_association.private_b: Refreshing state... [id=rtbassoc-086f25003cd7ad678]
aws_route_table.public: Refreshing state... [id=rtb-0f2bcd46b702b9ee0]
aws_security_group_rule.rds_from_bastion: Refreshing state... [id=sgrule-2890896799]
aws_route_table_association.private_a: Refreshing state... [id=rtbassoc-07f35ad4111286f9d]
aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-047e599a9347baa95]
aws_vpc_endpoint.logs: Refreshing state... [id=vpce-01aeb7d4c2f914500]
aws_sfn_state_machine.ml_training_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-ml-training-pipeline]
aws_lambda_function.migrate_schema: Refreshing state... [id=nba-cap-development-migrate-schema]
aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-06d1351c58050b1bc]
aws_vpc_endpoint.secretsmanager: Refreshing state... [id=vpce-0cc2835137bdb4431]
aws_db_subnet_group.main: Refreshing state... [id=nba-cap-development-db-subnet]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-08fac94fecdbb4de3]
aws_cloudwatch_event_target.monthly_training_target: Refreshing state... [id=nba-cap-development-monthly-ml-training-MonthlyMLTrainingPipeline]
aws_db_instance.main: Refreshing state... [id=db-EKSITIKQZJTCIAMKGGFH4JIJCQ]
aws_secretsmanager_secret_version.db_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1|terraform-20260218013731188500000001]
null_resource.trigger_schema_migration: Refreshing state... [id=3084102709976954210]
aws_cloudwatch_metric_alarm.rds_cpu: Refreshing state... [id=nba-cap-development-rds-high-cpu]
aws_lambda_function.load_predictions: Refreshing state... [id=nba-cap-development-load-predictions]
aws_lambda_function.load_to_rds: Refreshing state... [id=nba-cap-development-load-to-rds]
aws_iam_role_policy.ml_pipeline_sfn: Refreshing state... [id=nba-cap-development-ml-pipeline-sfn:nba-cap-development-ml-pipeline-sfn-policy]
aws_sfn_state_machine.ml_predictions_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-ml-predictions-pipeline]
aws_sfn_state_machine.etl_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-etl-pipeline]
aws_iam_role_policy.eventbridge_step_functions: Refreshing state... [id=nba-cap-development-eventbridge-sfn:nba-cap-development-eventbridge-sfn-policy]
aws_cloudwatch_event_target.monthly_etl_pipeline: Refreshing state... [id=nba-cap-development-monthly-etl-MonthlyETLStateMachine]
aws_cloudwatch_metric_alarm.etl_failures: Refreshing state... [id=nba-cap-development-etl-failures]
aws_cloudwatch_event_target.weekly_etl_pipeline: Refreshing state... [id=nba-cap-development-weekly-etl-WeeklyETLStateMachine]
aws_iam_role_policy.eventbridge_sfn: Refreshing state... [id=nba-cap-development-eventbridge-sfn-ml:nba-cap-development-eventbridge-sfn-policy]
aws_cloudwatch_event_target.weekly_predictions_target: Refreshing state... [id=nba-cap-development-weekly-ml-predictions-WeeklyMLPredictionsPipeline]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.main will be updated in-place
  ~ resource "aws_db_instance" "main" {
        id                                    = "db-EKSITIKQZJTCIAMKGGFH4JIJCQ"
      - password                              = (sensitive value) -> null
        tags                                  = {
            "Environment" = "development"
            "Project"     = "nba-cap"
        }
        # (55 unchanged attributes hidden)
    }

  # aws_s3_object.sagemaker_requirements will be created
  + resource "aws_s3_object" "sagemaker_requirements" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "nba-cap-development-data"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain"
      + etag                   = "baa7ac95a9b51b93bd325a3d486af371"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "ml/code/requirements.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../src/sagemaker/requirements.txt"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Description" = "Python dependencies for SageMaker jobs"
          + "Environment" = "development"
          + "Name"        = "SageMaker Requirements"
          + "Project"     = "nba-cap"
        }
      + tags_all               = {
          + "Description" = "Python dependencies for SageMaker jobs"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "SageMaker Requirements"
          + "Project"     = "nba-cap"
        }
      + version_id             = (known after apply)
    }

  # aws_secretsmanager_secret_version.db_credentials must be replaced
-/+ resource "aws_secretsmanager_secret_version" "db_credentials" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1|terraform-20260218013731188500000001" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20260218013731188500000001" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_security_group_rule.rds_from_bastion will be created
  + resource "aws_security_group_rule" "rds_from_bastion" {
      + description              = "PostgreSQL from bastion host"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0d332cdd9de9f1ea8"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-044703878f38eaf04"
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # aws_sfn_state_machine.ml_predictions_pipeline will be updated in-place
  ~ resource "aws_sfn_state_machine" "ml_predictions_pipeline" {
      ~ definition    = jsonencode(
          ~ {
              ~ States  = {
                  ~ FeatureEngineering  = {
                      ~ Parameters     = {
                          ~ ProcessingInputs       = [
                                {
                                    InputName = "code"
                                    S3Input   = {
                                        LocalPath   = "/opt/ml/processing/input/code"
                                        S3DataType  = "S3Prefix"
                                        S3InputMode = "File"
                                        S3Uri       = "s3://nba-cap-development-data/ml/code/feature_engineering.py"
                                    }
                                },
                              + {
                                  + InputName = "requirements"
                                  + S3Input   = {
                                      + LocalPath   = "/opt/ml/processing/input/code"
                                      + S3DataType  = "S3Prefix"
                                      + S3InputMode = "File"
                                      + S3Uri       = "s3://nba-cap-development-data/ml/code/requirements.txt"
                                    }
                                },
                            ]
                            # (7 unchanged attributes hidden)
                        }
                        # (6 unchanged attributes hidden)
                    }
                    # (6 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id            = "arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-ml-predictions-pipeline"
        name          = "nba-cap-development-ml-predictions-pipeline"
        tags          = {
            "Environment" = "development"
            "Project"     = "nba-cap"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_sfn_state_machine.ml_training_pipeline will be updated in-place
  ~ resource "aws_sfn_state_machine" "ml_training_pipeline" {
      ~ definition    = jsonencode(
          ~ {
              ~ States  = {
                  ~ FeatureEngineering  = {
                      ~ Parameters     = {
                          ~ ProcessingInputs       = [
                                {
                                    InputName = "code"
                                    S3Input   = {
                                        LocalPath   = "/opt/ml/processing/input/code"
                                        S3DataType  = "S3Prefix"
                                        S3InputMode = "File"
                                        S3Uri       = "s3://nba-cap-development-data/ml/code/feature_engineering.py"
                                    }
                                },
                              + {
                                  + InputName = "requirements"
                                  + S3Input   = {
                                      + LocalPath   = "/opt/ml/processing/input/code"
                                      + S3DataType  = "S3Prefix"
                                      + S3InputMode = "File"
                                      + S3Uri       = "s3://nba-cap-development-data/ml/code/requirements.txt"
                                    }
                                },
                            ]
                            # (7 unchanged attributes hidden)
                        }
                        # (6 unchanged attributes hidden)
                    }
                    # (4 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id            = "arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-ml-training-pipeline"
        name          = "nba-cap-development-ml-training-pipeline"
        tags          = {
            "Environment" = "development"
            "Project"     = "nba-cap"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

**Workspace:** dev
**Environment:** development
